TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x_dual/ipc/ipc_ex4_msgqueue_sysconfig_c28x2.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F2838x" --package "176pin" --part "F2838x_176pin" --context "CPU2" --product "C2000WARE"
 * 
 */

/**
 * Import the modules used in this configuration.
 */
const ipc = scripting.addModule("/driverlib/ipc.js");

/**
 * Write custom configuration values to the imported modules.
 */
ipc.ipcRegisterFlag          = ["IPC_FLAG31"];
ipc.flagHandler31            = "SYNC_FLAG";
ipc.registerInterrupts       = ["1"];
ipc.ipcInt1.enableInterrupt  = true;
ipc.ipcInt1.interruptHandler = "IPC_ISR1";
